app/views/dogs/show.html.erb

<p>
  <%= @dog.owner.first_name%>
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]