app/controllers/owners_controller.rb

    def current_owner
      @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]